# # Working With Missing Data
[From the dataquest.io site](https://www.dataquest.io/m/83/data-manipulation-with-pandas/5/normalizing-columns-in-a-data-set)
### <p style="color:Tomato">Learn to handle missing data using pandas, and a data set on Titanic survival.
<p/>
#### <p style="color:Gray">Clean and analyze data on passenger survival from the Titanic. Many of the columns, such as age and sex, have missing data.<p/>
* cause errors
* finding the mean of a column with a missing value is not successful.
because it's impossible to average  missing value.


<p style="color:Blue">**1. titanic_survival.csv**<p/>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
titanic_survival = pd.read_csv("titanic_survival.csv")

In [4]:
age = titanic_survival["age"]
print(age.loc[10:20])

10    47.0
11    18.0
12    24.0
13    26.0
14    80.0
15     NaN
16    24.0
17    50.0
18    32.0
19    36.0
20    37.0
Name: age, dtype: float64

In [5]:
age_is_null = pd.isnull(age)
age_null_true = age[age_is_null]
age_null_count = len(age_null_true)
print(age_null_count)

264

#### <p style="color:Gray">NaN<p/>
not a number, to indicate a missing value
#### <p style="color:Gray">pandas.isnull()<p/>
returns a series of True and False values.

In [6]:
sex = titanic_survival["sex"]
sex_is_null = pd.isnull(sex)
print(sex_is_null)

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1280    False
1281    False
1282    False
1283    False
1284    False
1285    False
1286    False
1287    False
1288    False
1289    False
1290    False
1291    False
1292    False
1293    False
1294    False
1295    False
1296    False
1297    False
1298    False
1299    False
1300    False
1301    False
1302    False
1303    False
1304    False
1305    False
1306    False
1307    False
1308    False
1309     True
Name: sex, Length: 1310, dtype: bool

In [7]:
sex_null_true = sex[sex_is_null]
print(sex_null_true)

1309    NaN
Name: sex, dtype: object

This is because any calculations we do with a null value also result in a null value.

In [8]:
age_is_null = pd.isnull(titanic_survival["age"])
good_ages = titanic_survival["age"][age_is_null == False]
correct_mean_age = sum(good_ages) / len(good_ages)
print(correct_mean_age)

29.8811345124

#### <p style="color:Gray">Series.mean()<p/>
To calculate the mean of a column,<br/>
missing values will not be includd in the calculation.

In [9]:
correct_mean_age = titanic_survival["age"].mean()
print(correct_mean_age)

29.8811345124283

Assign the mean of the "fare" column to correct_mean_fare.

In [10]:
correct_mean_fare = titanic_survival["fare"].mean()
print(correct_mean_fare)

33.29547928134572

In [11]:
passenger_classes = [1,2,3]
fares_by_class = {}

In [12]:
for this_class in passenger_classes:
#     print(this_class)
    pclass_rows = titanic_survival[titanic_survival["pclass"] == this_class] 
#     print(pclass_rows)
    pclass_fares = pclass_rows["fare"]
#     print(pclass_fares)
    fare_for_class = pclass_fares.mean()
    print(pclass_fares.mean())
#     print(fare_for_class)
    fares_by_class[this_class] = fare_for_class

87.50899164086687
21.1791963898917
13.302888700564957

In [13]:
print(fares_by_class[1])
print(fares_by_class[2])
print(fares_by_class[3])

87.50899164086687
21.1791963898917
13.302888700564957

#### <p style="color:Tomato"> Pivot tables<p/>
하나의 열로 하위 집합을 만든 다음 합계 또는 평균과 같은 계산을 적용할 수 있다. 
<br>
> 피벗 테이블을 먼저 그룹화 한 다음 계산을 적용한다. 위에서는 pclass열을 기준으로 그룹화 한 다음 각 클래스의 fare열의 평균을 계산하여 수동으로 피벗 테이블을 만들었다.

In [14]:
passenger_class_fares = titanic_survival.pivot_table(
    index="pclass", values="fare", aggfunc=np.mean)
print(passenger_class_fares)

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889

#### <p style="color:Gray">First parameter<p/>
> index tells the method which column to group by.
> Index는 메서드를 통해 그룹화 할 열을 알려준다.

#### <p style="color:Gray">Second parameter<p/>
> values is the column that we want to apply the calculation to,and aggfunc specifies the calculation we want to perform.
> 두 번째 매개 변수 값은 계산을 적용하려는 열이다. 

#### <p style="color:Gray">Third parameter<p/>
> aggfunc specifies the calculation we want to perform. The defalt for the aggfunc parameter is actually the mean.
> aggfunc는 수행하고자 하는 계산방법을 지정한다.

In [15]:
passenger_survival = titanic_survival.pivot_table(
    index="pclass", values="survived")
print(passenger_survival)

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

[http://pbpython.com/pandas-pivot-table-explained.html](http://pbpython.com/pandas-pivot-table-explained.html)

In [16]:
passenger_age = titanic_survival.pivot_table(index="pclass", values="age")
print(passenger_age)

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

A pivot table that calculates the total fares collected ("fare") and total number of survivors ("survived") for each embarkation port ("embarked") <br>
<br>
각 승선 포트에 대한 수집된 운임과 총 생존자 수

In [17]:
port_stats = titanic_survival.pivot_table(
    index="embarked", values=["fare", "survived"], 
    aggfunc=np.sum)
print(port_stats)

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

### Remove the missing values in a vector of data, and in a matrix

 #### <p style="color:Tomato"> What is matrix?<p/>
 #### <p style="color:Tomato"> What is vector?<p/>

#### <p style="color:Gray">DataFrame.dropna()<p/>
This method will drop any rows that contain missing values.

참고사이트: [결측값 있는 행 제거](http://rfriend.tistory.com/263)

```python
df.dropna(axis=0)
```
* Delete row with NaN <br>
* 결측값이 들어있는 행 전체를 삭제한다. <br>
* 모든 column은 유지되고, nan값이 들어있는 행만 삭제된다. 

```python
df.dropna(axis=1)
```
* Delete column with NaN <br>
* 결측값이 들어있는 열 전체를 삭제한다. <br>
* NaN값을 포함하고 있는 칼럼이 지워진다.

In [18]:
drop_na_rows = titanic_survival.dropna(axis=0)
drop_na_col = titanic_survival.dropna(axis=1)
print(drop_na_rows)
print(drop_na_col)

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[1310 rows x 0 columns]

```python
dat.dropna(how='any') #to drop if any value in the row has a nan
dat.dropna(how='all') #to drop if all values in the row are nan
```

In [19]:
len(titanic_survival.index)

1310

In [21]:
drop_na_columns = titanic_survival.dropna(
    axis=1)
print(drop_na_columns)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[1310 rows x 0 columns]

where the columns "age", "sex" have missing values and assign he result t new_titanic_survival.

In [25]:
new_titanic_survival = titanic_survival.dropna(axis=0, subset=["age", "sex"])
print(new_titanic_survival)

      pclass  survived                                               name  \
0        1.0       1.0                      Allen, Miss. Elisabeth Walton
1        1.0       1.0                     Allison, Master. Hudson Trevor
2        1.0       0.0                       Allison, Miss. Helen Loraine
3        1.0       0.0               Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5        1.0       1.0                                Anderson, Mr. Harry
6        1.0       1.0                  Andrews, Miss. Kornelia Theodosia
7        1.0       0.0                             Andrews, Mr. Thomas Jr
8        1.0       1.0      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9        1.0       0.0                            Artagaveytia, Mr. Ramon
10       1.0       0.0                             Astor, Col. John Jacob
11       1.0       1.0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1.0       1.0                      Aubart, Mme. Leontine Pauline
13       1.0       1.0                       Barber, Miss. Ellen "Nellie"
14       1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
16       1.0       0.0                           Baxter, Mr. Quigg Edmond
17       1.0       1.0    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18       1.0       1.0                              Bazzani, Miss. Albina
19       1.0       0.0                               Beattie, Mr. Thomson
20       1.0       1.0                      Beckwith, Mr. Richard Leonard
21       1.0       1.0   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22       1.0       1.0                              Behr, Mr. Karl Howell
23       1.0       1.0                              Bidois, Miss. Rosalie
24       1.0       1.0                                  Bird, Miss. Ellen
25       1.0       0.0                                Birnbaum, Mr. Jakob
26       1.0       1.0                            Bishop, Mr. Dickinson H
27       1.0       1.0            Bishop, Mrs. Dickinson H (Helen Walton)
28       1.0       1.0                             Bissette, Miss. Amelia
29       1.0       1.0          Bjornstrom-Steffansson, Mr. Mauritz Hakan
30       1.0       0.0                       Blackwell, Mr. Stephen Weart
...      ...       ...                                                ...
1269     3.0       0.0                   Vande Velde, Mr. Johannes Joseph
1270     3.0       0.0                     Vande Walle, Mr. Nestor Cyriel
1271     3.0       0.0                        Vanden Steen, Mr. Leo Peter
1272     3.0       0.0                        Vander Cruyssen, Mr. Victor
1273     3.0       0.0                 Vander Planke, Miss. Augusta Maria
1274     3.0       0.0                          Vander Planke, Mr. Julius
1275     3.0       0.0                    Vander Planke, Mr. Leo Edmondus
1276     3.0       0.0  Vander Planke, Mrs. Julius (Emelia Maria Vande...
1277     3.0       1.0                               Vartanian, Mr. David
1278     3.0       0.0                             Vendel, Mr. Olof Edvin
1279     3.0       0.0               Vestrom, Miss. Hulda Amanda Adolfina
1280     3.0       0.0                                    Vovk, Mr. Janko
1281     3.0       0.0                               Waelens, Mr. Achille
1285     3.0       0.0                                Wenzel, Mr. Linhart
1286     3.0       1.0    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1287     3.0       0.0                   Widegren, Mr. Carl/Charles Peter
1288     3.0       0.0                          Wiklund, Mr. Jakob Alfred
1289     3.0       0.0                            Wiklund, Mr. Karl Johan
1290     3.0       1.0                   Wilkes, Mrs. James (Ellen Needs)
1294     3.0       0.0                               Williams, Mr. Leslie
1295     3.0       0.0                                Windelov, Mr. Einar
1296     3.0       0.0                                   Wirz, Mr. Albert
1298     3.0       0.0                          Wittevrongel, Mr. Camille
1299     3.0       0.0                                Yasbeck, Mr. Antoni
1300     3.0       1.0            Yasbeck, Mrs. Antoni (Selini Alexander)
1301     3.0       0.0                               Youseff, Mr. Gerious
1304     3.0       0.0                               Zabour, Miss. Hileni
1306     3.0       0.0                          Zakarian, Mr. Mapriededer
1307     3.0       0.0                                Zakarian, Mr. Ortin
1308     3.0       0.0                                 Zimmerman, Mr. Leo

         sex      age  sibsp  parch            ticket      fare    cabin  \
0     female  29.0000    0.0    0.0             24160  211.3375       B5
1       male   0.9167    1.0    2.0            113781  151.5500  C22 C26
2     female   2.0000    1.0    2.0            113781  151.5500  C22 C26
3       male  30.0000    1.0    2.0            113781  151.5500  C22 C26
4     female  25.0000    1.0    2.0            113781  151.5500  C22 C26
5       male  48.0000    0.0    0.0             19952   26.5500      E12
6     female  63.0000    1.0    0.0             13502   77.9583       D7
7       male  39.0000    0.0    0.0            112050    0.0000      A36
8     female  53.0000    2.0    0.0             11769   51.4792     C101
9       male  71.0000    0.0    0.0          PC 17609   49.5042      NaN
10      male  47.0000    1.0    0.0          PC 17757  227.5250  C62 C64
11    female  18.0000    1.0    0.0          PC 17757  227.5250  C62 C64
12    female  24.0000    0.0    0.0          PC 17477   69.3000      B35
13    female  26.0000    0.0    0.0             19877   78.8500      NaN
14      male  80.0000    0.0    0.0             27042   30.0000      A23
16      male  24.0000    0.0    1.0          PC 17558  247.5208  B58 B60
17    female  50.0000    0.0    1.0          PC 17558  247.5208  B58 B60
18    female  32.0000    0.0    0.0             11813   76.2917      D15
19      male  36.0000    0.0    0.0             13050   75.2417       C6
20      male  37.0000    1.0    1.0             11751   52.5542      D35
21    female  47.0000    1.0    1.0             11751   52.5542      D35
22      male  26.0000    0.0    0.0            111369   30.0000     C148
23    female  42.0000    0.0    0.0          PC 17757  227.5250      NaN
24    female  29.0000    0.0    0.0          PC 17483  221.7792      C97
25      male  25.0000    0.0    0.0             13905   26.0000      NaN
26      male  25.0000    1.0    0.0             11967   91.0792      B49
27    female  19.0000    1.0    0.0             11967   91.0792      B49
28    female  35.0000    0.0    0.0          PC 17760  135.6333      C99
29      male  28.0000    0.0    0.0            110564   26.5500      C52
30      male  45.0000    0.0    0.0            113784   35.5000        T
...      ...      ...    ...    ...               ...       ...      ...
1269    male  33.0000    0.0    0.0            345780    9.5000      NaN
1270    male  28.0000    0.0    0.0            345770    9.5000      NaN
1271    male  28.0000    0.0    0.0            345783    9.5000      NaN
1272    male  47.0000    0.0    0.0            345765    9.0000      NaN
1273  female  18.0000    2.0    0.0            345764   18.0000      NaN
1274    male  31.0000    3.0    0.0            345763   18.0000      NaN
1275    male  16.0000    2.0    0.0            345764   18.0000      NaN
1276  female  31.0000    1.0    0.0            345763   18.0000      NaN
1277    male  22.0000    0.0    0.0              2658    7.2250      NaN
1278    male  20.0000    0.0    0.0            350416    7.8542      NaN
1279  female  14.0000    0.0    0.0            350406    7.8542      NaN
1280    male  22.0000    0.0    0.0            349252    7.8958      NaN
1281    male  22.0000    0.0    0.0            345767    9.0000      NaN
1285    male  32.5000    0.0    0.0            345775    9.5000      NaN
1286  female  38.0000    0.0    0.0              2688    7.2292      NaN
1287    male  51.0000    0.0    0.0            347064    7.7500      NaN
1288    male  18.0000    1.0    0.0           3101267    6.4958      NaN
1289    male  21.0000    1.0    0.0           3101266    6.4958      NaN
1290  female  47.0000    1.0    0.0            363272    7.0000      NaN
1294    male  28.5000    0.0    0.0             54636   16.1000      NaN
1295    male  21.0000    0.0    0.0  SOTON/OQ 3101317    7.2500      NaN
1296    male  27.0000    0.0    0.0            315154    8.6625      NaN
1298    male  36.0000    0.0    0.0            345771    9.5000      NaN
1299    male  27.0000    1.0    0.0              2659   14.4542      NaN
1300  female  15.0000    1.0    0.0              2659   14.4542      NaN
1301    male  45.5000    0.0    0.0              2628    7.2250      NaN
1304  female  14.5000    1.0    0.0              2665   14.4542      NaN
1306    male  26.5000    0.0    0.0              2656    7.2250      NaN
1307    male  27.0000    0.0    0.0              2670    7.2250      NaN
1308    male  29.0000    0.0    0.0            315082    7.8750      NaN

     embarked   boat   body                           home.dest
0           S      2    NaN                        St Louis, MO
1           S     11    NaN     Montreal, PQ / Chesterville, ON
2           S    NaN    NaN     Montreal, PQ / Chesterville, ON
3           S    NaN  135.0     Montreal, PQ / Chesterville, ON
4           S    NaN    NaN     Montreal, PQ / Chesterville, ON
5           S      3    NaN                        New York, NY
6           S     10    NaN                          Hudson, NY
7           S    NaN    NaN                         Belfast, NI
8           S      D    NaN                 Bayside, Queens, NY
9           C    NaN   22.0                 Montevideo, Uruguay
10          C    NaN  124.0                        New York, NY
11          C      4    NaN                        New York, NY
12          C      9    NaN                       Paris, France
13          S      6    NaN                                 NaN
14          S      B    NaN                       Hessle, Yorks
16          C    NaN    NaN                        Montreal, PQ
17          C      6    NaN                        Montreal, PQ
18          C      8    NaN                                 NaN
19          C      A    NaN                        Winnipeg, MN
20          S      5    NaN                        New York, NY
21          S      5    NaN                        New York, NY
22          C      5    NaN                        New York, NY
23          C      4    NaN                                 NaN
24          S      8    NaN                                 NaN
25          C    NaN  148.0                   San Francisco, CA
26          C      7    NaN                        Dowagiac, MI
27          C      7    NaN                        Dowagiac, MI
28          S      8    NaN                                 NaN
29          S      D    NaN  Stockholm, Sweden / Washington, DC
30          S    NaN    NaN                         Trenton, NJ
...       ...    ...    ...                                 ...
1269        S    NaN    NaN                                 NaN
1270        S    NaN    NaN                                 NaN
1271        S    NaN    NaN                                 NaN
1272        S    NaN    NaN                                 NaN
1273        S    NaN    NaN                                 NaN
1274        S    NaN    NaN                                 NaN
1275        S    NaN    NaN                                 NaN
1276        S    NaN    NaN                                 NaN
1277        C  13 15    NaN                                 NaN
1278        S    NaN    NaN                                 NaN
1279        S    NaN    NaN                                 NaN
1280        S    NaN    NaN                                 NaN
1281        S    NaN    NaN      Antwerp, Belgium / Stanton, OH
1285        S    NaN  298.0                                 NaN
1286        C      C    NaN                                 NaN
1287        S    NaN    NaN                                 NaN
1288        S    NaN  314.0                                 NaN
1289        S    NaN    NaN                                 NaN
1290        S    NaN    NaN                                 NaN
1294        S    NaN   14.0                                 NaN
1295        S    NaN    NaN                                 NaN
1296        S    NaN  131.0                                 NaN
1298        S    NaN    NaN                                 NaN
1299        C      C    NaN                                 NaN
1300        C    NaN    NaN                                 NaN
1301        C    NaN  312.0                                 NaN
1304        C    NaN  328.0                                 NaN
1306        C    NaN  304.0                                 NaN
1307        C    NaN    NaN                                 NaN
1308        S    NaN    NaN                                 NaN

[1046 rows x 14 columns]

#### <p style="color:Gray">Dataframe.loc()<p/>
These work just like column labels, and can be values like numbers, characters, and strings.

In [26]:
first_five_rows = new_titanic_survival.iloc[0:5]
print(first_five_rows)

   pclass  survived                                             name     sex  \
0     1.0       1.0                    Allen, Miss. Elisabeth Walton  female
1     1.0       1.0                   Allison, Master. Hudson Trevor    male
2     1.0       0.0                     Allison, Miss. Helen Loraine  female
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton    male
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000    0.0    0.0   24160  211.3375       B5        S    2    NaN
1   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11    NaN
2   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN    NaN
3  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN  135.0
4  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [27]:
first_ten_rows = new_titanic_survival.iloc[0:10]
print(first_ten_rows)

   pclass  survived                                             name     sex  \
0     1.0       1.0                    Allen, Miss. Elisabeth Walton  female
1     1.0       1.0                   Allison, Master. Hudson Trevor    male
2     1.0       0.0                     Allison, Miss. Helen Loraine  female
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton    male
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5     1.0       1.0                              Anderson, Mr. Harry    male
6     1.0       1.0                Andrews, Miss. Kornelia Theodosia  female
7     1.0       0.0                           Andrews, Mr. Thomas Jr    male
8     1.0       1.0    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9     1.0       0.0                          Artagaveytia, Mr. Ramon    male

       age  sibsp  parch    ticket      fare    cabin embarked boat   body  \
0  29.0000    0.0    0.0     24160  211.3375       B5        S    2    NaN
1   0.9167    1.0    2.0    113781  151.5500  C22 C26        S   11    NaN
2   2.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN    NaN
3  30.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN  135.0
4  25.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN    NaN
5  48.0000    0.0    0.0     19952   26.5500      E12        S    3    NaN
6  63.0000    1.0    0.0     13502   77.9583       D7        S   10    NaN
7  39.0000    0.0    0.0    112050    0.0000      A36        S  NaN    NaN
8  53.0000    2.0    0.0     11769   51.4792     C101        S    D    NaN
9  71.0000    0.0    0.0  PC 17609   49.5042      NaN        C  NaN   22.0

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON
5                     New York, NY
6                       Hudson, NY
7                      Belfast, NI
8              Bayside, Queens, NY
9              Montevideo, Uruguay

In [31]:
row_position_fifth = new_titanic_survival.iloc[4]
print(row_position_fifth)

pclass                                                     1
survived                                                   0
name         Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
sex                                                   female
age                                                       25
sibsp                                                      1
parch                                                      2
ticket                                                113781
fare                                                  151.55
cabin                                                C22 C26
embarked                                                   S
boat                                                     NaN
body                                                     NaN
home.dest                    Montreal, PQ / Chesterville, ON
Name: 4, dtype: object

Assign the row with index label 25 from new_titanic_survival

In [30]:
row_index_25 = new_titanic_survival.loc[25]